; domain
(define (domain name-domain)
 (:requirements :strips :typing :equality :numeric-fluents)
 (:types location)
 (:predicates (visited ?x - location))
 (:functions (x) (y) (z) (xl ?l - location) (yl ?l - location) (zl ?l - location) (battery_level) (battery_level_full) (min_x) (max_x) (min_y) (max_y) (min_z) (max_z))
 (:action increase_x
  :parameters ()
  :precondition (and (<= 1 (battery_level)) (<= (x) (- (max_x) 1)))
  :effect (and (increase (x) 1) (decrease (battery_level) 1)))
 (:action decrease_x
  :parameters ()
  :precondition (and (<= 1 (battery_level)) (<= (+ 1 (min_x)) (x)))
  :effect (and (decrease (x) 1) (decrease (battery_level) 1)))
 (:action increase_y
  :parameters ()
  :precondition (and (<= 1 (battery_level)) (<= (y) (- (max_y) 1)))
  :effect (and (increase (y) 1) (decrease (battery_level) 1)))
 (:action decrease_y
  :parameters ()
  :precondition (and (<= 1 (battery_level)) (<= (+ 1 (min_y)) (y)))
  :effect (and (decrease (y) 1) (decrease (battery_level) 1)))
 (:action increase_z
  :parameters ()
  :precondition (and (<= 1 (battery_level)) (<= (z) (- (max_z) 1)))
  :effect (and (increase (z) 1) (decrease (battery_level) 1)))
 (:action decrease_z
  :parameters ()
  :precondition (and (<= 1 (battery_level)) (<= (+ 1 (min_z)) (z)))
  :effect (and (decrease (z) 1) (decrease (battery_level) 1)))
 (:action visit
  :parameters ( ?l - location)
  :precondition (and (<= 1 (battery_level)) (= (xl ?l) (x)) (= (yl ?l) (y)) (= (zl ?l) (z)))
  :effect (and (visited ?l) (decrease (battery_level) 1)))
 (:action recharge
  :parameters ()
  :precondition (and (= (x) 0) (= (y) 0) (= (z) 0))
  :effect (and (assign (battery_level) (battery_level_full))))
)

; problem
(define (problem name-problem)
 (:domain name-domain)
 (:objects
   x0y0z0 x0y0z1 - location
 )
 (:init (= (x) 0) (= (y) 0) (= (z) 0) (= (min_x) 0) (= (max_x) 1) (= (min_y) 0) (= (max_y) 1) (= (min_z) 0) (= (max_z) 2) (= (xl x0y0z0) 0) (= (yl x0y0z0) 0) (= (zl x0y0z0) 0) (= (xl x0y0z1) 0) (= (yl x0y0z1) 0) (= (zl x0y0z1) 1) (= (battery_level) 9) (= (battery_level_full) 9))
 (:goal (and (visited x0y0z0) (visited x0y0z1) (= (x) 0) (= (y) 0) (= (z) 0)))
)

; plan
1. (visit x0y0z0)
   added: (visited x0y0z0)
   changed: (battery_level) from 9 to 8
   goals met: 4 of 5
2. (visit x0y0z0)
   changed: (battery_level) from 8 to 7
   goals met: 4 of 5
3. (increase_z)
   changed: (z) from 0 to 1, (battery_level) from 7 to 6
   goals met: 3 of 5
4. (visit x0y0z1)
   added: (visited x0y0z1)
   changed: (battery_level) from 6 to 5
   goals met: 4 of 5
5. (decrease_z)
   changed: (z) from 1 to 0, (battery_level) from 5 to 4
   goals met: 5 of 5
